{
  "projects": [
    {
      "image": "mail_app",
      "imageSecondary": "mail_app",
      "imageLogo": "",
      "name": "mail_app",
      "title": "Mail Client App",
      "tags": [
        "current"
      ],
      "description": "A mail client for desktop made using flutter. The goal of this project is to make a client which simply does your mail, with the ability to customize the client by disabling features you do not need. In the current state the client can read rendered HTML emails from one or multiple IMAP servers. The app is not tested for platforms other than Windows at the moment.",
      "sections": [],
      "links": [
        {
          "name": "Read More",
          "route": "/projects/mail_app"
        },
        {
          "name": "GitHub Repo",
          "route": "https://github.com/TychoBrouwer/Mail_App"
        }
      ]
    },
    {
      "image": "ac_controller",
      "imageSecondary": "ac_controller",
      "imageLogo": "",
      "name": "ac_controller",
      "title": "Universal AC Controller",
      "description": "This is a project for the USE course Detailing, Realization and RPC Testing. The project aims to allow an IR controlled air conditioner to become a smart air conditioner. The user can control their AC unit remotely using an app. This is achieved by forwarding the request from the remote device to a local device, which uses an IR transmitter to control the AC unit. The server can also relay weather information to the local device for smart temperature control by the air conditioner.",
      "sections": [],
      "links": [
        {
          "name": "Read More",
          "route": "/projects/ac_controller"
        },
        {
          "name": "GitHub Repo",
          "route": "https://github.com/TychoBrouwer/ac-controller-api-socket-python"
        }
      ]
    },
    {
      "image": "food_alarm",
      "imageSecondary": "food_alarm_2",
      "imageLogo": "food_alarm_logo",
      "name": "food_alarm",
      "title": "Food Alarm App",
      "description": "An mobile app made for the course Engineering Design, using React Native and Expo Go. The app's goal is to decrease food waste, it attempts to achieve this by allowing the user to track the food which is in the users house. It also provides a grocery store list and recipe database linked to the food stored in the inventory.",
      "sections": [
        {
          "text": "The mobile app is written in React Native using Expo Go. React Native is an open-source framework for JavaScript. It combines React, with app development for iOS and Android. Expo is an open-source platform for making mobile apps and it removes the necessity for an iOS and Android developer account for testing the app. Expo achieves this by hosting the app on the Expo Go mobile app. The back-end server for the app, which will be used as an authorization and database server, is made using Express.js.",
          "image": ""
        }
      ],
      "links": [
        {
          "name": "Read More",
          "route": "/projects/food_alarm"
        },
        {
          "name": "GitHub Repo",
          "route": "https://github.com/TychoBrouwer/Food_App_React_Native"
        }
      ]
    },
    {
      "image": "pokemon_like_game",
      "imageSecondary": "pokemon_like_game_2",
      "imageLogo": "",
      "name": "pokemon_like_game",
      "title": "Pokémon Inspired Game",
      "description": "A Pokémon inspired game written using Electron, TypeScript, and SCSS, more specifically the Pokémon Ruby version. The game is drawn onto an HTML canvas using request animation frame to invoke the repaint. The game has basic fighting mechanics following the original from Pokémon Ruby.",
      "sections": [],
      "links": [
        {
          "name": "Read More",
          "route": "/projects/pokemon_like_game"
        },
        {
          "name": "GitHub Repo",
          "route": "https://github.com/TychoBrouwer/Pokemon_Game_Electron"
        }
      ]
    },
    {
      "image": "snake_game",
      "imageSecondary": "snake_game",
      "imageLogo": "",
      "name": "snake_game",
      "title": "Snake Game",
      "description": "A snake game made using Electron, TypeScript, and SCSS. The game counts the current score and saves the high score. The player can also adjust the game speed and board size. ",
      "sections": [],
      "links": [
        {
          "name": "Read More",
          "route": "/projects/snake_game"
        },
        {
          "name": "GitHub Repo",
          "route": "https://github.com/TychoBrouwer/Snake_Game_Electron"
        }
      ]
    }
  ]
}